{
  "name": "Saifeleslam Elsayed",
  "title": "Web Developer",
  "email": "saifeleslamelsayed@gmail.com",
  "summary": "Passionate tech enthusiast coder adept at creating user-friendly, cutting-edge software solutions.",
  "about": {
    "past": "Reflecting on my journey, it's been a wild ride! From grinding through lectures at Cairo University to diving into the Silicon Valley scene at San José State University, I've been on a quest for knowledge. Snagged a sweet scholarship too! Along the way, I've tinkered with courses and lent a hand with many volunteering work, all in the pursuit of leveling up my tech skills.",
    "present": "Currently, I'm knee-deep in the tech world, soaking up every bit of knowledge I can get my hands on at AvidBeam. It's been a whirlwind of excitement! I've spearheaded some pretty cool projects like the Shopping Website and Bus Finder. Not to mention, I've clocked in some serious intern hours at spots like Hoopoe Digital and Bosta. Now, I'm itching for more challenges to tackle—bring 'em on!",
    "hobbies": "When I'm not pounding away at the keyboard, you'll catch me pumping iron at the gym, trying to keep this body in shape! And yeah, I've got a bit of a soft spot for documentaries and news. Especially hooked on anything that dives into the nitty-gritty of economics, history or news. Gotta keep those brain gears turning!"
  },
  "experience": [
    {
      "title": "Full-stack Developer",
      "company": "Avidbeam Technologies",
      "location": "Cairo, Egypt (Remote)",
      "from": "Aug 2023",
      "to": "Present",
      "description": "Developed and maintained website features, ensuring a seamless user experience while leveraging our company's expertise in AI technology. Integrated features of our model 'atun' through seamless integration with the web, providing users with enhanced functionality and a more personalized experience. Demonstrated problem-solving skills by efficiently identifying and rectifying bugs, ensuring optimal functionality. Prioritized code reliability and maintainability by meticulously writing tests and documentation for various components of the app.",
      "company_url": "https://www.avidbeam.com/",
      "skills": [
        "ReactJS",
        "NextJS",
        "Chakra UI",
        "Ruby on Rails",
        "WebSockets",
        "MongoDB",
        "elasticsearch",
        "kubernetes",
        "Docker",
        "protobuff",
        "gRPC",
        "RSpec",
        "RSwag"
      ]
    },
    {
      "title": "Web Development Intern",
      "company": "Hoopoe Digital",
      "location": "Cairo, Egypt",
      "from": "Jul 2022",
      "to": "Sep 2022",
      "description": "Played an integral role in the creation of an analytics platform and an indoor mapping application, contributing innovative solutions. Engineered intuitive user interfaces by constructing dynamic forms for map administrators, empowering seamless style and information customization. Leveraged advanced data visualization techniques with D3.js, building reusable graph components, enabling comprehensive data analysis and visualization.",
      "company_url": "https://www.hoopoe.digital/",
      "skills": [
        "HTML & CSS",
        "JavaScript",
        "TypeScript",
        "React.js",
        "D3.js",
        "Data Visualization",
        "Data Analysis",
        "GitLab",
        "Trello",
        "Agile"
      ]
    },
    {
      "title": "Quality Control Intern",
      "company": "Bosta",
      "location": "Giza, Egypt",
      "from": "Jul 2022",
      "to": "Sep 2022",
      "description": "Implemented rigorous testing methodologies across web and mobile applications and APIs, ensuring optimal performance and reliability in an Agile environment. Documented test cases and results in Jira, facilitating efficient bug identification and resolution processes. Conducted API testing using Postman and MongoDB queries with 3T Studio, ensuring seamless integration and functionality across platforms.",
      "company_url": "https://bosta.co/ar-eg/home",
      "skills": ["Agile", "Jira", "Postman", "MongoDB", "3T Studio"]
    },
    {
      "title": "Software Engineer Intern",
      "company": "Clear Pictures",
      "location": "Cairo Egypt",
      "from": "Jul 2021",
      "to": "Sep 2021",
      "description": "Co-developed a VR interactive chemistry lab application for Oculus Quest, focusing on game design and object functionality. Gained proficiency in Unity for game object design and C# for adding interactive features.",
      "company_url": "https://clearpictures.tv/",
      "skills": ["Unity", "C#"]
    }
  ],
  "projects": [
    {
      "title": "BuyMe E-commerce Platform",
      "description": "Developed an e-commerce platform with MERN stack; integrated Cloudinary for images, featuring distinct admin/customer UIs. Introduced functionalities such as order tracking, secure password reset via SendGrid, and a user-friendly shopping experience, showcasing full-stack development skills and user-centric design proficiency.",
      "url": "https://github.com/Saif-El-Eslam/buyme",
      "year": "2024",
      "made_at": "Self-directed Learning",
      "skills": [
        "React.js",
        "JavaScript",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Cloudinary",
        "SendGrid"
      ],
      "images": ["/projects/buyme.png"],
      "view": true
    },
    {
      "title": "Bus Finder",
      "description": "Developed a comprehensive Bus Share platform as a demo project for a master's degree student.  Led front-end development with ReactJS and Mapbox-GL. Crafted the backend infrastructure with Python and Flask with smooth interactions for admins, drivers, and riders. Adms can efficiently manage drivers, while drivers can visualize routes and access trip details. Riders enjoy a user-friendly interface for requesting trips and accessing trip information.",
      "url": "https://github.com/Saif-El-Eslam/route-optimization",
      "year": "2023",
      "made_at": "Freelance",
      "skills": ["React.js", "Python", "Flask", "Mapbox", "MongoDB"],
      "images": ["/projects/busfinder.png"],
      "view": true
    },
    {
      "title": "Graduation Project: Opinion Pilot",
      "description": "Developed an advanced Opinion Mining application for my graduation project at Cairo University to extract insights, quotes, and sentiment from news articles, blogs, and social media. Designed a user-friendly website for analysis and comparison of opinions on specific topics, utilizing NLP techniques for meaningful insights. ",
      "url": "https://github.com/Saif-El-Eslam/GP-opinion-mining",
      "year": "2023",
      "made_at": "Cairo University",
      "skills": ["NLP", "React.js", "Python", "Flask", "Machine Learning"],
      "images": ["/projects/opinionpilot.png"],
      "view": true
    },
    {
      "title": "World Cup Match Reservation System",
      "description": "Developed a dynamic World Cup Match Reservation System using the MERN stack. This user-friendly platform enables seamless sports reservation, allowing users to explore teams, match schedules, and reserve seats. With robust managerial tools and role-based access controls, it ensures efficient match management and a secure experience for all users.",
      "url": "https://github.com/hazemtarekelaswad/World-Cup-Match-Reservation-System",
      "year": "2023",
      "made_at": "Cairo University",
      "skills": ["React.js", "JavaScript", "Node.js", "MongoDB", "Express.js"],
      "images": ["/projects/worldcup.png"],
      "view": true
    },
    {
      "title": "Job Listing Website",
      "description": "Developed a robust job listing website, leveraging the power of the MERN stack to create a seamless user experience. This comprehensive platform caters to both job seekers and employers, offering intuitive interfaces tailored to their needs. Key features include profile management, job listings, and a real-time chat system powered by WebSockets. Employers benefit from an admin page for application review and candidate communication. Agile methodologies were employed for efficient project management, ensuring progress tracking and streamlined code management through Zenhub and Git.",
      "url": "https://github.com/emmagogogo/cs-160-group-2",
      "year": "2022",
      "made_at": "San Jose State University",
      "skills": ["React", "Node.js", "WebSockets", "zenhub", "Git", "Agile"],
      "images": [""],
      "view": false
    },
    {
      "title": "OS Scheduler",
      "description": "Developed process generator, schedulers (HPF, RR, SRTN), and implemented buddy memory allocation in C with a team of four students on Linux platform, enhancing problem-solving abilities.",
      "url": "https://github.com/AhmedYasser155/OS_Process_Scheduler",
      "year": "2022",
      "made_at": "Cairo University",
      "skills": ["C++ Programming", "Linux", "Problem Solving"],
      "images": [""]
    },
    {
      "title": "Hospital Management Application",
      "description": "Designed Windows-based application with different interfaces such as log-in interface, doctor interface, receptionist interface, and nurse interface in addition to developing and dealing with the database, adding, retrieving, updating, and deleting, using C# and SQL languages.",
      "url": "https://github.com/Saif-El-Eslam/Hospital-Management-App",
      "year": "2021",
      "made_at": "Cairo University",
      "skills": ["C#", "SQL", "Windows Forms"],
      "images": [""]
    },
    {
      "title": "Chemistry Lab - VR",
      "description": "Developed a chemistry lab project using Unity tool. Targeted for Oculus Quest, it serves as an educational application for children. Worked on game design, game loop, and interactive features like scale, heater, containers, etc.",
      "url": "https://github.com/MousaMohammad/VR-Chemistry-Lab",
      "year": "2021",
      "made_at": "Clear Pictures",
      "skills": ["Unity", "C#", "Game Design", "VR"],
      "images": [""]
    },
    {
      "title": "Castle Battle",
      "description": "A simulation of a battle between a castle and three types of enemies, each with its own special features. Utilized data structures including priority queue, stack, queue, and heap. Written in C++ with CMU graphics library for GUI stuff.",
      "url": "https://github.com/Saif-El-Eslam/Castle-Game",
      "year": "2021",
      "made_at": "Cairo University",
      "skills": ["C++", "Data Structures", "OOP", "Problem Solving"],
      "images": [""]
    },
    {
      "title": "Monopoly Customized Snakes and Ladders Game",
      "description": "Developed the algorithms used in the implementation of the monopoly cards derived classes and Input/Output classes using C++ / OOP.",
      "url": "https://github.com/Saif-El-Eslam/Snake-Ladder-with-monopoly-cards-game",
      "year": "2020",
      "made_at": "Cairo University",
      "skills": ["C++", "OOP", "Problem Solving"],
      "images": [""]
    }
  ],
  "links": [
    {
      "title": "Email",
      "icon": "/icons/email.png",
      "url": "https://mail.google.com/mail/?view=cm&fs=1&to=saifeleslamelsayed@gmail.com"
    },
    {
      "title": "LinkedIn",
      "icon": "/icons/linkedin.svg",
      "url": "https://www.linkedin.com/in/saifeleslam-elsayed/"
    },
    {
      "title": "GitHub",
      "icon": "/icons/github.svg",
      "url": "https://github.com/Saif-El-Eslam?tab=repositories"
    },

    {
      "title": "Instagram",
      "icon": "/icons/instagram.svg",
      "url": "https://www.instagram.com/saif_el_eslam_/"
    },
    {
      "title": "Facebook",
      "icon": "/icons/facebook.svg",
      "url": "https://www.facebook.com/profile.php?id=100010966657947"
    }
  ],
  "copyWrite": {
    "design": "https://brittanychiang.com",
    "code": "© 2024 Saifeleslam Elsayed."
  }
}
