{
  "name": "Saifeleslam Elsayed",
  "title": "Web Developer",
  "email": "saifeleslamelsayed@gmail.com",
  "summary": "Passionate tech enthusiast coder adept at creating user-friendly, cutting-edge software solutions.",
  "about": {
    "past": "Reflecting on my journey, it's been a wild ride! From grinding through lectures at Cairo University to diving into the Silicon Valley scene at San José State University, I've been on a quest for knowledge. Snagged a sweet scholarship too! Along the way, I've tinkered with courses and lent a hand with many volunteering work, all in the pursuit of leveling up my tech skills.",
    "present": "Currently, I'm knee-deep in the tech world, soaking up every bit of knowledge I can get my hands on at AvidBeam. It's been a whirlwind of excitement! I've spearheaded some pretty cool projects like the Shopping Website and Bus Finder. Not to mention, I've clocked in some serious intern hours at spots like Hoopoe Digital and Bosta. Now, I'm itching for more challenges to tackle—bring 'em on!",
    "hobbies": "When I'm not pounding away at the keyboard, you'll catch me pumping iron at the gym, trying to keep this body in shape! And yeah, I've got a bit of a soft spot for documentaries and news. Especially hooked on anything that dives into the nitty-gritty of economics, history or news. Gotta keep those brain gears turning!"
  },
  "experience": [
    {
      "title": "Full-stack Developer",
      "company": "Avidbeam Technologies",
      "location": "Cairo, Egypt (Remote)",
      "from": "Sep 2023",
      "to": "Present",
      "description": "Developed and maintained website features, ensuring a seamless user experience while leveraging our company's expertise in AI technology. Integrated features of our model 'atun' through seamless integration with the web, providing users with enhanced functionality and a more personalized experience. Demonstrated problem-solving skills by efficiently identifying and rectifying bugs, ensuring optimal functionality. Prioritized code reliability and maintainability by meticulously writing tests and documentation for various components of the app.",
      "company_url": "https://www.avidbeam.com/",
      "skills": [
        "ReactJS",
        "Chakra UI",
        "Ruby on Rails",
        "WebSockets",
        "MongoDB",
        "elasticsearch",
        "kubernetes",
        "Docker",
        "protobuff",
        "gRPC",
        "RSpec",
        "RSwag"
      ]
    },
    {
      "title": "Web Development Intern",
      "company": "Hoopoe Digital",
      "location": "Cairo, Egypt",
      "from": "Jul 2022",
      "to": "Sep 2022",
      "description": "Played an integral role in the creation of an analytics platform and an indoor mapping application, contributing innovative solutions. Engineered intuitive user interfaces by constructing dynamic forms for map administrators, empowering seamless style and information customization. Leveraged advanced data visualization techniques with D3.js, building reusable graph components, enabling comprehensive data analysis and visualization.",
      "company_url": "https://www.hoopoe.digital/",
      "skills": [
        "HTML & CSS",
        "JavaScript",
        "TypeScript",
        "React.js",
        "D3.js",
        "Data Visualization",
        "Data Analysis",
        "GitLab",
        "Trello",
        "Agile"
      ]
    },
    {
      "title": "Quality Control Intern",
      "company": "Bosta",
      "location": "Giza, Egypt",
      "from": "Jul 2021",
      "to": "Sep 2021",
      "description": "Implemented rigorous testing methodologies across web and mobile applications and APIs, ensuring optimal performance and reliability in an Agile environment. Documented test cases and results in Jira, facilitating efficient bug identification and resolution processes. Conducted API testing using Postman and MongoDB queries with 3T Studio, ensuring seamless integration and functionality across platforms.",
      "company_url": "https://bosta.co/ar-eg/home",
      "skills": ["Agile", "Jira", "Postman", "MongoDB", "3T Studio"]
    },
    {
      "title": "Software Engineer Intern",
      "company": "Clear Pictures",
      "location": "Cairo Egypt",
      "from": "Jul 2021",
      "to": "Sep 2021",
      "description": "Co-developed a VR interactive chemistry lab application for Oculus Quest, focusing on game design and object functionality. Gained proficiency in Unity for game object design and C# for adding interactive features.",
      "company_url": "https://clearpictures.tv/",
      "skills": ["Unity", "C#"]
    }
  ],
  "projects": [
    {
      "title": "Harvard Business School Next.js Site",
      "description": "this the project description. Other details can be added here. this the project description. Other details can be added here. this the project description. Other details can be added here.",
      "url": "https://www.vodafone.com.eg/",
      "year": "2018",
      "made_at": "Vodafone",
      "skills": [],
      "images": [
        "projects/R0.png",
        "images/vodafone-1.jpg",
        "images/vodafone-2.jpg",
        "images/vodafone-3.jpg"
      ]
    },
    {
      "title": "Vodafone Egypt",
      "description": "this the project description. Other details can be added here. this the project description. Other details can be added here.",
      "url": "",
      "year": "2018",
      "made_at": "Vodafone",
      "skills": ["HTML", "CSS", "JavaScript", "React"],
      "images": [
        "projects/R0.png",
        "images/vodafone-1.jpg",
        "images/vodafone-2.jpg",
        "images/vodafone-3.jpg"
      ]
    }
  ],
  "links": [
    {
      "title": "Email",
      "icon": "icons/email.png",
      "url": "https://mail.google.com/mail/?view=cm&fs=1&to=saifeleslamelsayed@gmail.com"
    },
    {
      "title": "LinkedIn",
      "icon": "icons/linkedin.svg",
      "url": "https://www.linkedin.com/in/saifeleslam-elsayed/"
    },
    {
      "title": "GitHub",
      "icon": "icons/github.svg",
      "url": "https://github.com/Saif-El-Eslam?tab=repositories"
    },

    {
      "title": "Instagram",
      "icon": "icons/instagram.svg",
      "url": "https://www.instagram.com/saif_el_eslam_/"
    },
    {
      "title": "Facebook",
      "icon": "icons/facebook.svg",
      "url": "https://www.facebook.com/profile.php?id=100010966657947"
    }
  ],
  "copyWrite": {
    "design": "https://brittanychiang.com/",
    "code": "© 2024 Saifeleslam Elsayed."
  }
}
